In [1]:
import pandas as pd
import re
from collections import namedtuple
import os 
pd.set_option('display.max_rows', 500)
pd.set_option('display.max_columns', 500)
pd.set_option('display.width', 1000)
import numpy as np

### 1. Importing and  merging pop files
### 2. Adding Metropolitans and Micropolitans

In [2]:
pop_2010_2019 = pd.read_excel('../data/raw_data/GA/pop_est_2010-2019_ga.xlsx',sheet_name='Sheet1')
pop_2010_2019 = pd.DataFrame(pop_2010_2019)
pop_2010_2019 = pop_2010_2019.drop(['Census','Estimates Base',2010,2011,2012],axis=1)
pop_2010_2019.head()

     County   2013   2014   2015   2016   2017   2018   2019
0   Appling  18370  18472  18423  18428  18438  18526  18386
1  Atkinson   8264   8215   8340   8244   8182   8262   8165
2     Bacon  11173  11178  11231  11275  11205  11132  11164
3     Baker   3348   3288   3194   3183   3159   3086   3038
4   Baldwin  46178  45910  45549  45259  44963  44893  44890

In [3]:
pop_2020_2021 = pd.read_excel('../data/raw_data/GA/pop_est_2020-2021_ga.xlsx',sheet_name='Sheet1')
pop_2020_2021 = pd.DataFrame(pop_2020_2021)
pop_2020_2021 = pop_2020_2021.drop('Estimates Base',axis=1)
pop_2020_2021.head()

     County   2020   2021
0   Appling  18428  18488
1  Atkinson   8301   8391
2     Bacon  11123  11079
3     Baker   2844   2819
4   Baldwin  43773  43781

In [4]:
pop_combined = pd.merge(pop_2010_2019,pop_2020_2021,how="left",on="County")
pop_combined['County'] = pop_combined['County'].str.strip()
pop_combined['County'] = pop_combined['County'].str.upper()
pop_combined.head()

     County   2013   2014   2015   2016   2017   2018   2019   2020   2021
0   APPLING  18370  18472  18423  18428  18438  18526  18386  18428  18488
1  ATKINSON   8264   8215   8340   8244   8182   8262   8165   8301   8391
2     BACON  11173  11178  11231  11275  11205  11132  11164  11123  11079
3     BAKER   3348   3288   3194   3183   3159   3086   3038   2844   2819
4   BALDWIN  46178  45910  45549  45259  44963  44893  44890  43773  43781

In [5]:
metros = pd.read_excel('../data/metro_areas.xlsx',sheet_name='Filtered_States')
metros_df = pd.DataFrame(metros)
metros_ga = metros_df[metros_df['State Name']=='Georgia']
metros_ga['County'] = metros_ga['County'].str.strip()
metros_ga['County'] = metros_ga['County'].str.upper()
metros_ga.head()

C:\Users\iulia\AppData\Local\Temp/ipykernel_27564/1420390612.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  metros_ga['County'] = metros_ga['County'].str.strip()
C:\Users\iulia\AppData\Local\Temp/ipykernel_27564/1420390612.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  metros_ga['County'] = metros_ga['County'].str.upper()

                              CBSA Title Metropolitan/Micropolitan Statistical Area    County State Name
12                           Douglas, GA              Micropolitan Statistical Area  ATKINSON    Georgia
15                     Milledgeville, GA              Micropolitan Statistical Area   BALDWIN    Georgia
17  Atlanta-Sandy Springs-Alpharetta, GA              Metropolitan Statistical Area    BARROW    Georgia
18  Atlanta-Sandy Springs-Alpharetta, GA              Metropolitan Statistical Area    BARTOW    Georgia
25                        Fitzgerald, GA              Micropolitan Statistical Area  BEN HILL    Georgia

In [6]:
file ='../data/raw_data/GA/GA_2013.csv'
ga = pd.read_csv(file)
df_ga = pd.DataFrame(ga)
df_ga.head(10)

         Date and Time Area: County  # of Fatalities (Person Table)  # Serious Injuries  # Visible Injuries  # Complaint Injuries
0  01/03/2013 12:02 PM        Crisp                             0.0                 0.0                 0.0                   0.0
1  01/11/2013 07:49 AM      Chatham                             0.0                 0.0                 0.0                   0.0
2  07/27/2013 06:23 PM       Newton                             0.0                 0.0                 0.0                   0.0
3  04/23/2013 10:52 AM          NaN                             0.0                 0.0                 0.0                   0.0
4  10/01/2013 08:43 AM        Troup                             0.0                 0.0                 0.0                   0.0
5  12/30/2013 01:29 PM      Liberty                             0.0                 0.0                 1.0                   2.0
6  12/28/2013 10:59 PM     Paulding                             0.0                 0.0                 0.0                   1.0
7  11/30/2013 12:00 PM     Gwinnett                             0.0                 0.0                 0.0                   7.0
8  12/09/2013 10:38 PM          NaN                             0.0                 0.0                 0.0                   0.0
9  12/16/2013 04:52 PM      Jackson                             0.0                 0.0                 0.0                   0.0

In [7]:
df_ga.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 327263 entries, 0 to 327262
Data columns (total 6 columns):
 #   Column                          Non-Null Count   Dtype
---  ------                          --------------   -----
 0   Date and Time                   327263 non-null  object
 1   Area: County                    312821 non-null  object
 2   # of Fatalities (Person Table)  326235 non-null  float64
 3   # Serious Injuries              326235 non-null  float64
 4   # Visible Injuries              326235 non-null  float64
 5   # Complaint Injuries            326235 non-null  float64
dtypes: float64(4), object(2)
memory usage: 15.0+ MB

In [8]:
df_ga_new = df_ga.groupby(['Area: County']).agg({'# of Fatalities (Person Table)':'sum','# Serious Injuries':'sum','# Visible Injuries':'sum','# Complaint Injuries':'sum'}).reset_index()
df_ga_new['total_crashes'] = df_ga_new.sum(axis = 1)
df_ga_new['Injuries'] = df_ga_new['# Serious Injuries'] + df_ga_new['# Visible Injuries'] + df_ga_new['# Complaint Injuries']
df_ga_new = df_ga_new.drop(columns=['# Serious Injuries','# Visible Injuries','# Complaint Injuries'],axis=1)
df_ga_new.columns = ['County','fatalaties','total_crashes','injuries']
df_ga_new.head()

C:\Users\iulia\AppData\Local\Temp/ipykernel_27564/416597001.py:2: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df_ga_new['total_crashes'] = df_ga_new.sum(axis = 1)

     County  fatalaties  total_crashes  injuries
0   Appling         1.0          182.0     181.0
1  Atkinson         0.0           47.0      47.0
2     Bacon         2.0          111.0     109.0
3     Baker         0.0           17.0      17.0
4   Baldwin         6.0          640.0     634.0

In [9]:
for filename in os.listdir("../data/raw_data/GA/"):
    if filename.startswith("GA_"):
        year = re.findall(r'\d{4}',filename)
        for var in year:
            name = int(var)
        ga_file = pd.read_csv(os.path.join("../data/raw_data/GA/", filename))
        df_ga = pd.DataFrame(ga_file)
        df_ga_new = df_ga.groupby(['Area: County']).agg({'# of Fatalities (Person Table)':'sum','# Serious Injuries':'sum','# Visible Injuries':'sum','# Complaint Injuries':'sum'}).reset_index()
        df_ga_new['total_crashes'] = df_ga_new.sum(axis = 1)
        df_ga_new['Injuries'] = df_ga_new['# Serious Injuries'] + df_ga_new['# Visible Injuries'] + df_ga_new['# Complaint Injuries']
        df_ga_new = df_ga_new.drop(columns=['# Serious Injuries','# Visible Injuries','# Complaint Injuries'],axis=1)
        df_ga_new.columns = ['County','fatalaties','total_crashes','injuries']
        df_ga_new = df_ga_new[['County','fatalaties','injuries','total_crashes']]
        df_ga_new['County'] = df_ga_new['County'].str.strip()
        df_ga_new['County'] = df_ga_new['County'].str.upper()
        df_combined_ga = pd.merge(df_ga_new,pop_combined[['County', name]],on="County",how='left')
        df_combined_ga_new = pd.merge(df_combined_ga,metros_ga[['CBSA Title','Metropolitan/Micropolitan Statistical Area','County']],on="County",how='left')
        df_combined_ga_new.rename(columns = {name:'population'}, inplace = True)
        df_combined_ga_new.insert(0,'Year',name)
        df_combined_ga_new.to_excel('../data/cleaned_data/%s_GA.xlsx' % name, engine='xlsxwriter',index=False)
    else:
        continue

C:\Users\iulia\AppData\Local\Temp/ipykernel_27564/1180279932.py:9: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df_ga_new['total_crashes'] = df_ga_new.sum(axis = 1)

### Combining all the files into a master file

In [10]:
data_file_folder ='../data/cleaned_data/'
df = []
for file in os.listdir(data_file_folder):
        if file.endswith('_TN.xlsx'):             
             df.append(pd.read_excel(os.path.join(data_file_folder,file),sheet_name='Sheet1'))
df_ga_master = pd.concat(df, axis = 0)

In [11]:
df_ga_master.isna().sum()

Year                                            0
County                                          0
fatalities                                      0
injuries                                        0
total_crashes                                   0
population                                      2
CBSA Title                                    250
Metropolitan/Micropolitan Statistical Area    250
dtype: int64

In [12]:
df_ga_master.head(10)

   Year    County  fatalities injuries total_crashes  population                                      CBSA Title Metropolitan/Micropolitan Statistical Area
0  2013  ANDERSON          10      445         1,769     75299.0                                   Knoxville, TN              Metropolitan Statistical Area
1  2013   BEDFORD          13      287           987     45565.0                                 Shelbyville, TN              Micropolitan Statistical Area
2  2013    BENTON          10       94           304     16360.0                                             NaN                                        NaN
3  2013   BLEDSOE           0       31            80     13910.0                                             NaN                                        NaN
4  2013    BLOUNT          24      734         2,981    124874.0                                   Knoxville, TN              Metropolitan Statistical Area
5  2013   BRADLEY           9      608         2,895    101778.0                                   Cleveland, TN              Metropolitan Statistical Area
6  2013  CAMPBELL           9      269           895     40247.0                                   Knoxville, TN              Metropolitan Statistical Area
7  2013    CANNON           3       72           265     13700.0  Nashville-Davidson--Murfreesboro--Franklin, TN              Metropolitan Statistical Area
8  2013   CARROLL           9      116           392     28606.0                                             NaN                                        NaN
9  2013    CARTER           6      267         1,204     56978.0                                Johnson City, TN              Metropolitan Statistical Area

In [13]:
df_ga_master.tail(10)

    Year      County  fatalities injuries total_crashes  population                                      CBSA Title Metropolitan/Micropolitan Statistical Area
85  2020      UNICOI           3       74           290     17867.0                                Johnson City, TN              Metropolitan Statistical Area
86  2020       UNION           9       59           187     19820.0                                   Knoxville, TN              Metropolitan Statistical Area
87  2020    VANBUREN           0       20            97      6171.0                                             NaN                                        NaN
88  2020      WARREN           6      171           757     41023.0                                 McMinnville, TN              Micropolitan Statistical Area
89  2020  WASHINGTON           8      580         3,508    133080.0                                Johnson City, TN              Metropolitan Statistical Area
90  2020       WAYNE           2       54           250     16202.0                                             NaN                                        NaN
91  2020     WEAKLEY           9      110           440     32864.0                                      Martin, TN              Micropolitan Statistical Area
92  2020       WHITE           4       94           427     27424.0                                             NaN                                        NaN
93  2020  WILLIAMSON          16      719         3,853    249424.0  Nashville-Davidson--Murfreesboro--Franklin, TN              Metropolitan Statistical Area
94  2020      WILSON          16      798         3,250    148564.0  Nashville-Davidson--Murfreesboro--Franklin, TN              Metropolitan Statistical Area

In [14]:
df_ga_master.to_excel('../data/GA.xlsx', engine='xlsxwriter',index=False)